
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>事件循环1 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="event_loop_2.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../Chapter1/">
            
                <a href="../Chapter1/">
            
                    
                    第一章 GitBook
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../Chapter2/">
            
                <a href="../Chapter2/">
            
                    
                    第二章 mongoDB
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../Chapter3/">
            
                <a href="../Chapter3/">
            
                    
                    第三章 vue2.x 源码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="./">
            
                <a href="./">
            
                    
                    第四章 javascript
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.5.1" data-path="event_loop_1.html">
            
                <a href="event_loop_1.html">
            
                    
                    事件循环1
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="event_loop_2.html">
            
                <a href="event_loop_2.html">
            
                    
                    事件循环2
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >事件循环1</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;1">[&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;1]</h1>
<p>JavaScript &#x662F;&#x4E00;&#x95E8;&#x5355;&#x7EBF;&#x7A0B;&#x7684;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x3002;&#x6240;&#x8C13;&#x5355;&#x7EBF;&#x7A0B;&#xFF0C;&#x5C31;&#x662F;&#x6307;&#x6240;&#x6709;&#x7684;&#x4EFB;&#x52A1;&#x90FD;&#x9700;&#x8981;&#x6392;&#x961F;&#x4E00;&#x4E2A;&#x4E2A;&#x6267;&#x884C;&#xFF0C;&#x53EA;&#x6709;&#x524D;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x5B8C;&#x4E86;&#x624D;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x540E;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x8FD9;&#x5C31;&#x9020;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x524D;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x8017;&#x65F6;&#x8FC7;&#x957F;&#xFF0C;&#x5219;&#x4F1A;&#x963B;&#x585E;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x5728;&#x9875;&#x9762;&#x4E0A;&#x7528;&#x6237;&#x7684;&#x611F;&#x77E5;&#x4FBF;&#x4F1A;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x5361;&#x6B7B;&#x7684;&#x73B0;&#x8C61;&#xFF1B;</p>
<p>&#x800C;&#x7531;&#x4E8E;&#x5728;&#x5927;&#x90E8;&#x5206;&#x7684;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;&#x9020;&#x6210;&#x4EFB;&#x52A1;&#x8017;&#x65F6;&#x8FC7;&#x957F;&#x4E0D;&#x662F;&#x4EFB;&#x52A1;&#x672C;&#x8EAB;&#x8BA1;&#x7B97;&#x91CF;&#x5927;&#x800C;&#x5BFC;&#x81F4; CPU &#x5904;&#x7406;&#x4E0D;&#x8FC7;&#x6765;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x8BE5;&#x4EFB;&#x52A1;&#x9700;&#x8981;&#x4E0E; IO &#x8BBE;&#x5907;&#x4EA4;&#x4E92;&#x800C;&#x5BFC;&#x81F4;&#x7684;&#x8017;&#x65F6;&#x8FC7;&#x957F;&#xFF0C;&#x4F46;&#x8FD9;&#x65F6; CPU &#x5374;&#x662F;&#x5904;&#x4E8E;&#x95F2;&#x7F6E;&#x72B6;&#x6001;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4FBF;&#x6709;&#x4E86;&#x672C;&#x7AE0;&#x8282;&#x7684; JavaScript&#xFF08;&#x4E5F;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#xFF09;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#xFF08;Event Loop&#xFF09;&#x673A;&#x5236;
&#x5728; JavaScript &#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x673A;&#x5236;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x5230;&#x4E86;&#x4E09;&#x79CD;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x6808;&#xFF08;Stack&#xFF09;&#x3001;&#x5806;&#xFF08;Heap&#xFF09;&#x548C;&#x961F;&#x5217;&#xFF08;Queue&#xFF09;&#x3002;</p>
<blockquote>
<p>&#x6808;&#xFF1A;<strong>&#x4E00;&#x79CD;&#x540E;&#x8FDB;&#x5148;&#x51FA;&#xFF08;LIFO&#xFF09;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x53D6;&#x4E52;&#x4E53;&#x7403;&#x65F6;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x540E;&#x9762;&#x653E;&#x8FDB;&#x53BB;&#x7684;&#x4E52;&#x4E53;&#x7403;&#x53CD;&#x800C;&#x662F;&#x6700;&#x5148;&#x53D6;&#x51FA;&#x6765;&#x7684;</strong>&#x3002;</p>
<p>&#x5806;&#xFF1A;<strong>&#x4E00;&#x79CD;&#x6811;&#x72B6;&#x7684;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x5728;&#x56FE;&#x4E66;&#x9986;&#x4E2D;&#x53D6;&#x4E66;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x56FE;&#x4E66;&#x7D22;&#x5F15;&#x7684;&#x65B9;&#x5F0F;&#x76F4;&#x63A5;&#x627E;&#x5230;&#x9700;&#x8981;&#x7684;&#x4E66;</strong>&#x3002;</p>
<p>&#x961F;&#x5217;&#xFF1A;<strong>&#x4E00;&#x79CD;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#xFF08;FIFO&#xFF09;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x5373;&#x6211;&#x4EEC;&#x5E73;&#x65F6;&#x6392;&#x961F;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x5148;&#x6392;&#x7684;&#x4EBA;&#x603B;&#x662F;&#x5148;&#x51FA;&#x961F;&#x5217;</strong>&#x3002;</p>
</blockquote>
<p>&#x5728; JavaScript &#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x673A;&#x5236;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x6808;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4FBF;&#x662F;&#x6267;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#x6808;&#xFF0C;<strong>&#x6BCF;&#x5F53;&#x6709;&#x51FD;&#x6570;&#x88AB;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x4FBF;&#x4F1A;&#x521B;&#x5EFA;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x6267;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#x5E76;&#x5C06;&#x5176;&#x5165;&#x6808;</strong>&#xFF1B;<strong>&#x4F7F;&#x7528;&#x5230;&#x5806;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E86;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5927;&#x90E8;&#x5206;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x5B58;&#x653E;&#x5BF9;&#x8C61;</strong>&#xFF1B;<strong>&#x4F7F;&#x7528;&#x5230;&#x7684;&#x961F;&#x5217;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4FBF;&#x662F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;</strong></p>
<p><img src="imgs/png1.png" alt=""></p>
<p>&#x6267;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#x6808;
&#x5728; JavaScript &#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x8FDB;&#x5165;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x6267;&#x884C;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x4E00;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x65F6;&#x6700;&#x5148;&#x8FDB;&#x5165;&#x5230;&#x5168;&#x5C40;&#x73AF;&#x5883;&#xFF0C;&#x6B64;&#x65F6;&#x5168;&#x5C40;&#x4E0A;&#x4E0B;&#x6587;&#x9996;&#x5148;&#x88AB;&#x521B;&#x5EFA;&#x5E76;&#x5165;&#x6808;&#xFF0C;&#x4E4B;&#x540E;&#x5F53;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x65F6;&#x5219;&#x8FDB;&#x5165;&#x76F8;&#x5E94;&#x7684;&#x51FD;&#x6570;&#x73AF;&#x5883;&#xFF0C;&#x6B64;&#x65F6;&#x76F8;&#x5E94;&#x51FD;&#x6570;&#x4E0A;&#x4E0B;&#x6587;&#x88AB;&#x521B;&#x5EFA;&#x5E76;&#x5165;&#x6808;&#xFF0C;&#x5F53;&#x5904;&#x4E8E;&#x6808;&#x9876;&#x7684;&#x6267;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x5219;&#x4F1A;&#x5C06;&#x5176;&#x51FA;&#x6808;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x6808;&#x4FBF;&#x662F;&#x6267;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#x6808;&#x3002;
&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF5E;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">fn2</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;fn2&apos;</span>)
}
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">fn1</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;fn1&apos;</span>)
    fn2();
}

fn1();
</code></pre>
<p>&#x4EFB;&#x52A1;&#x961F;&#x5217;
&#x5728; JavaScript &#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x673A;&#x5236;&#x4E2D;&#xFF0C;&#x5B58;&#x5728;&#x591A;&#x79CD;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#xFF0C;&#x5176;&#x5206;&#x4E3A;&#x5B8F;&#x4EFB;&#x52A1;&#xFF08;macro-task&#xFF09;&#x548C;&#x5FAE;&#x4EFB;&#x52A1;&#xFF08;micro-task&#xFF09;&#x4E24;&#x79CD;&#x3002;</p>
<blockquote>
<p><strong>&#x5B8F;&#x4EFB;&#x52A1;&#x5305;&#x62EC;&#xFF1A;setTimeout&#x3001;setInterval&#x3001;I/O&#x3001;UI rendering</strong>
<strong>&#x5FAE;&#x4EFB;&#x52A1;&#x5305;&#x62EC;&#xFF1A;process.nextTick&#x3001;Promise&#x3001;Object.observe&#xFF08;&#x5DF2;&#x5E9F;&#x5F03;&#xFF09;&#x3001;MutationObserver&#xFF08;html5&#x65B0;&#x7279;&#x6027;&#xFF09;</strong></p>
</blockquote>
<p>&#x4E0A;&#x8FF0;&#x6240;&#x63CF;&#x8FF0;&#x7684; setTimeout&#x3001;Promise &#x7B49;&#x90FD;&#x662F;&#x6307;&#x4E00;&#x79CD;&#x4EFB;&#x52A1;&#x6E90;&#xFF0C;&#x5176;&#x5BF9;&#x5E94;&#x4E00;&#x79CD;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#xFF0C;&#x771F;&#x6B63;&#x653E;&#x5165;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x7684;&#xFF0C;&#x662F;&#x4EFB;&#x52A1;&#x6E90;&#x6307;&#x5B9A;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x3002;&#x5728;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9047;&#x5230;&#x4E0A;&#x8FF0;&#x4EFB;&#x52A1;&#x6E90;&#x65F6;&#xFF0C;&#x4F1A;&#x5C06;&#x8BE5;&#x4EFB;&#x52A1;&#x6E90;&#x6307;&#x5B9A;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x653E;&#x5165;&#x4E0D;&#x540C;&#x7684;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x3002;
&#x4E0D;&#x540C;&#x7684;&#x4EFB;&#x52A1;&#x6E90;&#x5BF9;&#x5E94;&#x7684;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x5176;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x4F18;&#x5148;&#x7EA7;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x4E0A;&#x8FF0;&#x5B8F;&#x4EFB;&#x52A1;&#x548C;&#x5FAE;&#x4EFB;&#x52A1;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x4EE3;&#x8868;&#x4E86;&#x5176;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x3002;
&#x5373;&#x5728;&#x5B8F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x5404;&#x4E2A;&#x961F;&#x5217;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x4E3A;
<strong>setTimeout &gt; setInterval &gt; I/O</strong>
&#x5728;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x5404;&#x4E2A;&#x961F;&#x5217;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x4E3A;
<strong>Promise &gt; Object.observe &gt; MutationObserver</strong>
&#x5BF9;&#x4E8E; UI rendering &#x6765;&#x8BF4;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x5728;&#x6BCF;&#x6B21;&#x6E05;&#x7A7A;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4F1A;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x89E6;&#x53D1;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x505A;&#x8BE6;&#x7EC6;&#x8D58;&#x8FF0;&#x3002;
&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x673A;&#x5236;&#x6D41;&#x7A0B;</p>
<blockquote>
<p>&#x4E3B;&#x7EBF;&#x7A0B;&#x6267;&#x884C; JavaScript &#x6574;&#x4F53;&#x4EE3;&#x7801;&#xFF0C;&#x5F62;&#x6210;&#x6267;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#x6808;&#xFF0C;&#x5F53;&#x9047;&#x5230;&#x5404;&#x79CD;&#x4EFB;&#x52A1;&#x6E90;&#x65F6;&#x5C06;&#x5176;&#x6240;&#x6307;&#x5B9A;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x6302;&#x8D77;&#xFF0C;&#x63A5;&#x53D7;&#x5230;&#x54CD;&#x5E94;&#x7ED3;&#x679C;&#x540E;&#x5C06;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x653E;&#x5165;&#x5BF9;&#x5E94;&#x7684;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x76F4;&#x5230;&#x6267;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#x6808;&#x53EA;&#x5269;&#x5168;&#x5C40;&#x4E0A;&#x4E0B;&#x6587;&#xFF1B;
&#x5C06;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x6309;&#x4F18;&#x5148;&#x7EA7;&#x3001;&#x5355;&#x4E2A;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x5165;&#x6808;&#x5E76;&#x6267;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x6E05;&#x7A7A;&#x6240;&#x6709;&#x7684;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#xFF1B;
&#x5C06;&#x5B8F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x4F18;&#x5148;&#x7EA7;&#x6700;&#x9AD8;&#x7684;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x5165;&#x6808;&#x5E76;&#x6267;&#x884C;&#xFF1B;
&#x91CD;&#x590D;&#x7B2C; 2 3 &#x6B65;&#x9AA4;&#xFF0C;&#x76F4;&#x5230;&#x6E05;&#x7A7A;&#x6240;&#x6709;&#x7684;&#x5B8F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x548C;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#xFF0C;&#x5168;&#x5C40;&#x4E0A;&#x4E0B;&#x6587;&#x51FA;&#x6808;&#x3002;</p>
</blockquote>
<p><strong>&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x673A;&#x5236;&#x7684;&#x6D41;&#x7A0B;&#x5C31;&#x662F;&#xFF0C;&#x4E3B;&#x7EBF;&#x7A0B;&#x6267;&#x884C; JavaScript &#x6574;&#x4F53;&#x4EE3;&#x7801;&#x540E;&#x5C06;&#x9047;&#x5230;&#x7684;&#x5404;&#x4E2A;&#x4EFB;&#x52A1;&#x6E90;&#x6240;&#x6307;&#x5B9A;&#x7684;&#x4EFB;&#x52A1;&#x5206;&#x53D1;&#x5230;&#x5404;&#x4E2A;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x548C;&#x5B8F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4EA4;&#x66FF;&#x5165;&#x6808;&#x6267;&#x884C;&#x76F4;&#x5230;&#x6E05;&#x7A7A;&#x6240;&#x6709;&#x7684;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#xFF0C;&#x5168;&#x5C40;&#x4E0A;&#x4E0B;&#x6587;&#x51FA;&#x6808;</strong></p>
<p><img src="imgs/png2.png" alt="" title="&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x673A;&#x5236;"></p>
<pre><code class="lang-javascript">
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;global&apos;</span>);

setTimeout(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;setTimeout1&apos;</span>);
    <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve</span>) </span>{
        <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;setTimeout1_promise&apos;</span>);
        resolve();
    }).then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
        <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;setTimeout1_promiseThen&apos;</span>)
    })
    process.nextTick(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
        <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;setTimeout1_nextTick&apos;</span>);
    })
},<span class="hljs-number">0</span>)

<span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve</span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;promise1&apos;</span>);
    resolve();
}).then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;promiseThen1&apos;</span>)
})

setImmediate(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;setImmediate&apos;</span>);
})

process.nextTick(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;nextTick&apos;</span>);
})

<span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve</span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;promise2&apos;</span>);
    resolve();
}).then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;promiseThen2&apos;</span>)
})

setTimeout(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;setTimeout2&apos;</span>);
},<span class="hljs-number">0</span>)
</code></pre>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4E3B;&#x8981;&#x5206;&#x6790;&#x5728;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x6D41;&#x7A0B;&#x4E2D;&#x5404;&#x4E2A;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x7684;&#x53D8;&#x5316;&#x60C5;&#x51B5;&#xFF0C;&#x5BF9;&#x4E8E;&#x6267;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#x6808;&#x7684;&#x884C;&#x4E3A;&#x6682;&#x4E0D;&#x505A;&#x5206;&#x6790;&#x3002;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x56FE;&#x4E2D;&#x5DE6;&#x8FB9;&#x4EE3;&#x8868;&#x961F;&#x5934;&#xFF0C;&#x53F3;&#x8FB9;&#x4EE3;&#x8868;&#x961F;&#x5C3E;&#x3002;
&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x8BE5;&#x4F8B;&#x5B50;&#x4E2D;&#x6709;&#x591A;&#x4E2A;&#x5B8F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x548C;&#x591A;&#x4E2A;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x52A0;&#x5165;&#x4E86; node &#x4E2D;&#x7684; setImmediate &#x548C; process.nextTick &#xFF0C;node &#x4E2D;&#x7684;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x673A;&#x5236;&#x4E0E; JavaScript &#x7C7B;&#x4F3C;&#xFF0C;&#x53EA;&#x662F;&#x5176;&#x5B9E;&#x73B0;&#x673A;&#x5236;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x3002;&#x52A0;&#x5165; node &#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#x540E;&#xFF0C;&#x5176;&#x4F18;&#x5148;&#x7EA7;&#x5982;&#x4E0B;
&#x5728;&#x5B8F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x5404;&#x4E2A;&#x961F;&#x5217;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x4E3A;
<strong>setTimeout &gt; setInterval &gt; setImmediate  &gt; I/O</strong>
&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x5404;&#x4E2A;&#x961F;&#x5217;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x4E3A;
<strong>process.nextTick &gt; Promise.then &gt; Object.observe &gt; MutationObserver</strong>
&#x6240;&#x4EE5;&#x4E0A;&#x8FF0;&#x4F8B;&#x5B50;&#x53EA;&#x80FD;&#x591F;&#x5728; node &#x73AF;&#x5883;&#x4E2D;&#x6267;&#x884C;&#xFF0C;&#x4E0D;&#x80FD;&#x591F;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x6267;&#x884C;&#x3002;&#x90A3;&#x4E48;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x4E00;&#x6B65;&#x6B65;&#x5206;&#x6790;&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x4E00;&#xFF0C;&#x6267;&#x884C; Javascript &#x4EE3;&#x7801;&#xFF0C;&#x5168;&#x5C40;&#x4E0A;&#x4E0B;&#x6587;&#x5165;&#x6808;&#xFF0C;&#x8F93;&#x51FA; global &#xFF0C;&#x6B64;&#x65F6;&#x9047;&#x5230;&#x7B2C;&#x4E00;&#x4E2A; setTimeout &#x4EFB;&#x52A1;&#x6E90;&#xFF0C;&#x7531;&#x4E8E;&#x5176;&#x6267;&#x884C;&#x5EF6;&#x8FDF;&#x65F6;&#x95F4;&#x4E3A; 0&#xFF0C;&#x6240;&#x4EE5;&#x80FD;&#x591F;&#x7ACB;&#x5373;&#x63A5;&#x6536;&#x5230;&#x54CD;&#x5E94;&#x7ED3;&#x679C;&#xFF0C;&#x5C06;&#x5176;&#x6307;&#x5B9A;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x653E;&#x5165;&#x5B8F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#xFF1B;
<img src="imgs/p1.png" alt="alt p1"></p>
<p>&#x4E8C;&#xFF0C;&#x9047;&#x5230;&#x7B2C;&#x4E00;&#x4E2A; Promise &#x4EFB;&#x52A1;&#x6E90;&#xFF0C;&#x6B64;&#x65F6;&#x4F1A;&#x6267;&#x884C; Promise &#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5373;&#x8F93;&#x51FA; promise1&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x6307;&#x5B9A;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#xFF08;then &#x4E2D;&#x51FD;&#x6570;&#xFF09;&#x653E;&#x5165;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#xFF1B;
<img src="imgs/p2.png" alt="alt p2"></p>
<p>&#x4E09;&#xFF0C;&#x9047;&#x5230; setImmediate &#x4EFB;&#x52A1;&#x6E90;&#xFF0C;&#x5C06;&#x5176;&#x6307;&#x5B9A;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x653E;&#x5165;&#x5B8F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#xFF1B;
<img src="imgs/p3.png" alt="alt p3">
&#x56DB;&#xFF0C;&#x9047;&#x5230; nextTick &#x4EFB;&#x52A1;&#x6E90;&#xFF0C;&#x5C06;&#x5176;&#x6307;&#x5B9A;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x653E;&#x5165;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#xFF1B;
<img src="imgs/p4.png" alt="alt p4">
&#x4E94;&#xFF0C;&#x9047;&#x5230;&#x7B2C;&#x4E8C;&#x4E2A; Promise &#x4EFB;&#x52A1;&#x6E90;&#xFF0C;&#x8F93;&#x51FA; promise2&#xFF0C;&#x5C06;&#x5176;&#x6307;&#x5B9A;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x653E;&#x5165;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#xFF1B;
<img src="imgs/p5.png" alt="alt p5">
&#x516D;&#xFF0C;&#x9047;&#x5230;&#x7B2C;&#x4E8C;&#x4E2A; setTimeout &#x4EFB;&#x52A1;&#x6E90;&#xFF0C;&#x5C06;&#x5176;&#x6307;&#x5B9A;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x653E;&#x5165;&#x5B8F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#xFF1B;
<img src="imgs/p6.png" alt="alt p6">
&#x4E03;&#xFF0C;JavaScript &#x6574;&#x4F53;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x5F00;&#x59CB;&#x6E05;&#x7A7A;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#xFF0C;&#x5C06;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x6309;&#x4F18;&#x5148;&#x7EA7;&#x3001;&#x5355;&#x4E2A;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x6309;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#x7684;&#x65B9;&#x5F0F;&#x5165;&#x6808;&#x5E76;&#x6267;&#x884C;&#x3002;&#x6B64;&#x65F6;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x5B58;&#x5728; Promise &#x548C; nextTick &#x961F;&#x5217;&#xFF0C;nextTick &#x961F;&#x5217;&#x4F18;&#x5148;&#x7EA7;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x53D6;&#x51FA; nextTick &#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x5165;&#x6808;&#x6267;&#x884C;&#xFF0C;&#x8F93;&#x51FA; nextTick&#xFF1B;
<img src="imgs/p7.png" alt="alt p7">
&#x516B;&#xFF0C;&#x53D6;&#x51FA; Promise1 &#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x5165;&#x6808;&#x6267;&#x884C;&#xFF0C;&#x8F93;&#x51FA; promiseThen1&#xFF1B;
<img src="imgs/p8.png" alt="alt p8">
&#x4E5D;&#xFF0C;&#x53D6;&#x51FA; Promise2 &#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x5165;&#x6808;&#x6267;&#x884C;&#xFF0C;&#x8F93;&#x51FA; promiseThen2&#xFF1B;
<img src="imgs/p9.png" alt="alt p9">
&#x5341;&#xFF0C;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x6E05;&#x7A7A;&#x5B8C;&#x6BD5;&#xFF0C;&#x6267;&#x884C;&#x5B8F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#xFF0C;&#x5C06;&#x5B8F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x4F18;&#x5148;&#x7EA7;&#x6700;&#x9AD8;&#x7684;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x6309;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#x7684;&#x65B9;&#x5F0F;&#x5165;&#x6808;&#x5E76;&#x6267;&#x884C;&#x3002;&#x6B64;&#x65F6;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5B8F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x5B58;&#x5728; setTimeout &#x548C; setImmediate &#x961F;&#x5217;&#xFF0C;setTimeout &#x961F;&#x5217;&#x4F18;&#x5148;&#x7EA7;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x53D6;&#x51FA; setTimeout1 &#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x5165;&#x6808;&#x6267;&#x884C;&#xFF0C;&#x8F93;&#x51FA; setTimeout1&#xFF0C;&#x9047;&#x5230; Promise &#x548C; nextTick &#x4EFB;&#x52A1;&#x6E90;&#xFF0C;&#x8F93;&#x51FA; setTimeout1_promise&#xFF0C;&#x5C06;&#x5176;&#x6307;&#x5B9A;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x653E;&#x5165;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#xFF1B;
<img src="imgs/p10.png" alt="alt p10">
&#x5341;&#x4E00;&#xFF0C;&#x53D6;&#x51FA; setTimeout2 &#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x5165;&#x6808;&#x6267;&#x884C;&#xFF0C;&#x8F93;&#x51FA; setTimeout2&#xFF1B;
<img src="imgs/p11.png" alt="alt p11">
&#x5341;&#x4E8C;&#xFF0C;&#x81F3;&#x6B64;&#x4E00;&#x4E2A;&#x5FAE;&#x4EFB;&#x52A1;&#x5B8F;&#x4EFB;&#x52A1;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x5B8C;&#x6BD5;&#xFF0C;&#x5F00;&#x59CB;&#x4E0B;&#x4E00;&#x8F6E;&#x5FAA;&#x73AF;&#x3002;&#x4ECE;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x7684; nextTick &#x961F;&#x5217;&#x53D6;&#x51FA; setTimeout1_nextTick &#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x5165;&#x6808;&#x6267;&#x884C;&#xFF0C;&#x8F93;&#x51FA; setTimeout1_nextTick&#xFF1B;
<img src="imgs/p12.png" alt="alt p12">
&#x5341;&#x4E09;&#xFF0C;&#x4ECE;&#x5FAE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x7684; Promise &#x961F;&#x5217;&#x53D6;&#x51FA; setTimeout1_promise &#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x5165;&#x6808;&#x6267;&#x884C;&#xFF0C;&#x8F93;&#x51FA; setTimeout1_promiseThen&#xFF1B;
<img src="imgs/p13.png" alt="alt p13">
&#x5341;&#x56DB;&#xFF0C;&#x4ECE;&#x5B8F;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x7684; setImmediate &#x961F;&#x5217;&#x53D6;&#x51FA; setImmediate &#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x5165;&#x6808;&#x6267;&#x884C;&#xFF0C;&#x8F93;&#x51FA; setImmediate&#xFF1B;
<img src="imgs/p14.png" alt="alt p14">
&#x5341;&#x4E94;&#xFF0C;&#x5168;&#x5C40;&#x4E0A;&#x4E0B;&#x6587;&#x51FA;&#x6808;&#xFF0C;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x3002;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E3A;</p>
<p>&#x6700;&#x540E;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E3A;&#xFF1A;</p>
<pre><code class="lang-javascript">global
promise1
promise2
nextTick
promiseThen1
promiseThen2
setTimeout1
setTimeout1_promise
setTimeout1_nextTick
setTimeout1_promiseThen
setTimeout2
setImmediate
</code></pre>
<blockquote>
<p>&#x539F;&#x6587;&#x5730;&#x5740;&#xFF1A;<a href="https://juejin.cn/post/6844903634816204813" target="_blank">https://juejin.cn/post/6844903634816204813</a></p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 第四章 javascript">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="event_loop_2.html" class="navigation navigation-next " aria-label="Next page: 事件循环2">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"事件循环1","level":"1.5.1","depth":2,"next":{"title":"事件循环2","level":"1.5.2","depth":2,"path":"Chapter4/event_loop_2.md","ref":"Chapter4/event_loop_2.md","articles":[]},"previous":{"title":"第四章 javascript","level":"1.5","depth":1,"path":"Chapter4/README.md","ref":"Chapter4/README.md","articles":[{"title":"事件循环1","level":"1.5.1","depth":2,"path":"Chapter4/event_loop_1.md","ref":"Chapter4/event_loop_1.md","articles":[]},{"title":"事件循环2","level":"1.5.2","depth":2,"path":"Chapter4/event_loop_2.md","ref":"Chapter4/event_loop_2.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Chapter4/event_loop_1.md","mtime":"2021-02-19T09:29:38.726Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-19T09:35:43.836Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

